# Getting started with pandas

In [2]:
from pandas import Series, DataFrame
import pandas as pd

In [3]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))

from pandas import Series, DataFrame                      # 시리즈와 데이터프레임을 임포트 함
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

'C:\\dev\\_python\\pydata-book-1st-edition'

## Introduction to pandas data structures

### Series

In [4]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
'e' in obj2

False

In [22]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4  # 캘리포니아 값이 없음  - NaN.

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)   # pandas 함수 isNull

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
obj3 + obj4                    # 시리즈 끼리 더해짐.
# 인덱스가 같은 것 끼리 계산이 됨.  NaN + NaN = NaN
#  정수 + 실수 => 실수
#  5000 + NaN   => NaN

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [40]:
obj4.name = 'population'           # 시리즈에 name이라는 속성    => 시리즈의 이름이 됨.
obj4.index.name = 'state'          #     index의 이름
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [41]:
obj4.name
obj4.index.name

'population'

'state'

In [49]:
obj # 0,1,2,3

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [42]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']        # 인덱스와 인덱스 네임은 다른거임!!  
                                                    # 인덱스는 값들
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [37]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [51]:
name = Series([1,2,3,4], index=['Bob', 'Bob', 'Ryan', 'King'])
name

Bob     1
Bob     2
Ryan    3
King    4
dtype: int64

In [52]:
obj + name

Bob      5.0
Bob      6.0
Jeff     NaN
King     NaN
Ryan     6.0
Steve    NaN
dtype: float64

### DataFrame

In [54]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], # 각각 5개씩
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [55]:
frame    # 칼럼의 이름은 정렬이 되서 나타난다.

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [15]:
DataFrame(data, columns=['year', 'state', 'pop'])   
             # 이름을 바꾸는 것이 아니라, 작성한 순서대로 컬럼 순서가 나옴.

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [56]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2      # debt 칼럼에는 값이 없으므로 NaN
            # 4개의 데이터프레임이 같이 있다고 보면 됨.

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [57]:
frame2.columns    # 칼럼 이름만 쏙 빼온다.

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [59]:
frame2['state']     # [] 색인 indexing 하겠다.  칼럼을 지정하겠다.
type(frame2['state'])  # 시리즈

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

pandas.core.series.Series

In [60]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [62]:
frame2.ix['three']   # .ix 프로퍼티
# DeprecationWarning => 지금은 지원하지 않음.  loc - 이름으로 지징할때 / iloc - 위치값으로 할 때 0번째 1번째 ...
# 앞으로 지원 안할 수 있음.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [65]:
frame2.loc['three']    # 이렇게 쓰자.      둘중 하나 선택해서 쓰도록!
frame2.iloc[2]         # 위치는 정수값이 와야함!!  0, 1, 2

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [68]:
frame2.debt

one      0.0
two      1.0
three    2.0
four     3.0
five     4.0
Name: debt, dtype: float64

In [66]:
frame2['debt'] = 16.5      # 브로드캐스팅 룰이 적용됨.
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [67]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [69]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [70]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [77]:
frame2['eastern'] = frame2.state == 'Ohio'
                       # 이거랑 같은 가? 
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [78]:
del frame2['eastern']    # 항목을 지우는 것
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [79]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [81]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [82]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [83]:
frame3.T   # 행렬 바꾸기 (전치)

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [84]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [86]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [88]:
pdata = {'Ohio': frame3['Ohio'][:-1],         #   [:-1]. 마지막 원소 직전까지
         'Nevada': frame3['Nevada'][:2]}       #  [:2]     0,1 까지
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [87]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

### Index objects

In [91]:
range(3)
list(range(3))

range(0, 3)

[0, 1, 2]

In [92]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index     # index 오브젝트

Index(['a', 'b', 'c'], dtype='object')

In [94]:
index[1:]      # 인덱스의 일부를 참조했더니 인덱스...

Index(['b', 'c'], dtype='object')

In [95]:
index[1] = 'd'    # 인덱스의 값은 직접 변경할 수 없다.

TypeError: Index does not support mutable operations

In [96]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [97]:
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [98]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [99]:
'Ohio' in frame3.columns  # columns 에 ohio가 있느냐?

True

In [101]:
2003 in frame3.index     # index = row의 이름

False

In [102]:
dir(index)

['T',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__bytes__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__init__',
 '__init_subclass__',
 '__inv__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmul__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__unicode__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_comparison_methods',
 '_add_logical_methods',
 '_add_logical_methods_disabled',
 '_add_numeric_methods',
 '_add_numeric_methods_add_sub_disabled',
 '_add_numeric_methods_binary',
 '_add_numeric_methods_disabled',
 '_add_numeric_methods_unary',
 '_allow_datetime_index_ops',
 '_allow_index_ops',
 '_allow_period_index_ops',
 '_arrmap',
 '_assert_can_do_op',
 '_assert_can_do_setop',
 '_assert_safe_casting',
 '_assert_take_fillable',
 '_attributes',
 '_box_scalars',
 '_can_hold_na',
 '_can_reindex',
 '_cleanup',
 '_coerce_scalar_to_index',
 '_coerce_to_ndarray',
 '_comparables',
 '_concat',
 '_concat_same_dtype',
 '_constructor',
 '_convert_arr_indexer',
 '_convert_can_do_setop',
 '_convert_for_op',
 '_convert_index_indexer',
 '_convert_list_indexer',
 '_convert_listlike_indexer',
 '_convert_scalar_indexer',
 '_convert_slice_indexer',
 '_convert_tolerance',
 '_data',
 '_deepcopy_if_needed',
 '_default_dtype',
 '_defer_to_indexing',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_engine',
 '_engine_type',
 '_evaluate_compare',
 '_evaluate_with_datetime_like',
 '_evaluate_with_timedelta_like',
 '_filter_indexer_tolerance',
 '_format_attrs',
 '_format_data',
 '_format_native_types',
 '_format_space',
 '_format_with_header',
 '_formatter_func',
 '_get_attributes_dict',
 '_get_consensus_name',
 '_get_duplicates',
 '_get_fill_indexer',
 '_get_fill_indexer_searchsorted',
 '_get_grouper_for_level',
 '_get_level_number',
 '_get_level_values',
 '_get_loc_only_exact_matches',
 '_get_names',
 '_get_nearest_indexer',
 '_get_string_slice',
 '_get_unique_index',
 '_has_complex_internals',
 '_id',
 '_infer_as_myclass',
 '_inner_indexer',
 '_invalid_indexer',
 '_is_memory_usage_qualified',
 '_is_numeric_dtype',
 '_is_strictly_monotonic_decreasing',
 '_is_strictly_monotonic_increasing',
 '_isnan',
 '_join_level',
 '_join_monotonic',
 '_join_multi',
 '_join_non_unique',
 '_join_precedence',
 '_left_indexer',
 '_left_indexer_unique',
 '_maybe_cast_indexer',
 '_maybe_cast_slice_bound',
 '_maybe_promote',
 '_maybe_update_attributes',
 '_mpl_repr',
 '_na_value',
 '_nan_idxs',
 '_outer_indexer',
 '_reduce',
 '_reindex_non_unique',
 '_reset_cache',
 '_reset_identity',
 '_scalar_data_error',
 '_searchsorted_monotonic',
 '_set_names',
 '_shallow_copy',
 '_shallow_copy_with_infer',
 '_simple_new',
 '_sort_levels_monotonic',
 '_string_data_error',
 '_to_embed',
 '_to_safe_for_reshape',
 '_try_convert_to_int_index',
 '_typ',
 '_unpickle_compat',
 '_update_inplace',
 '_validate_for_numeric_binop',
 '_validate_for_numeric_unaryop',
 '_validate_index_level',
 '_validate_indexer',
 '_validate_names',
 '_values',
 '_wrap_joined_index',
 '_wrap_union_result',
 'all',
 'any',
 'append',
 'argmax',
 'argmin',
 'argsort',
 'asi8',
 'asof',
 'asof_locs',
 'astype',
 'base',
 'contains',
 'copy',
 'data',
 'delete',
 'difference',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtype',
 'dtype_str',
 'duplicated',
 'empty',
 'equals',
 'factorize',
 'fillna',
 'flags',
 'format',
 'get_duplicates',
 'get_indexer',
 'get_indexer_for',
 'get_indexer_non_unique',
 'get_level_values',
 'get_loc',
 'get_slice_bound',
 'get_value',
 'get_values',
 'groupby',
 'has_duplicates',
 'hasnans',
 'holds_integer',
 'identical',
 'inferred_type',
 'insert',
 'intersection',
 'is_',
 'is_all_dates',
 'is_boolean',
 'is_categorical',
 'is_floating',
 'is_integer',
 'is_interval',
 'is_lexsorted_for_tuple',
 'is_mixed',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_numeric',
 'is_object',
 'is_type_compatible',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'itemsize',
 'join',
 'map',
 'max',
 'memory_usage',
 'min',
 'name',
 'names',
 'nbytes',
 'ndim',
 'nlevels',
 'notna',
 'notnull',
 'nunique',
 'putmask',
 'ravel',
 'reindex',
 'rename',
 'repeat',
 'reshape',
 'searchsorted',
 'set_names',
 'set_value',
 'shape',
 'shift',
 'size',
 'slice_indexer',
 'slice_locs',
 'sort',
 'sort_values',
 'sortlevel',
 'strides',
 'summary',
 'symmetric_difference',
 'take',
 'to_datetime',
 'to_frame',
 'to_native_types',
 'to_series',
 'tolist',
 'transpose',
 'union',
 'unique',
 'value_counts',
 'values',
 'view',
 'where']

## Essential functionality

### Reindexing

In [121]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj     # d b a c 순으로 되어있음

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [122]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2     # 다시 인덱스를 정렬하고 싶을 때 
obj

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [123]:
obj.a = -5.1          # obj['a'] = -5.1 과 동일
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [124]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.1
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [125]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [137]:
obj3.loc[2]    # 인덱스 명  
obj3.iloc[2]   # 인덱스의 위치 (  0 ~ 숫자  )

obj3[2]        # 레이블로 인식한다. 
# obj3[1]     # 에러 발생
obj2[2]       # 정수가 아닌 것이면 몇 번째 데이타로   /    정수면 = 레이블이 된다.

'purple'

'yellow'

'purple'

3.6

In [139]:
obj3.reindex(range(6))      # 0 ~ 5    빈칸에는 NaN으로 뜰 것임

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [140]:
obj3.reindex(range(6), method='ffill')    # method 옵션 - 디폴트 값을 채우는 방법
       #- 상황에 따라서 앞에 있는 값을 채워라
# obj3.reindex(range(6), method='bfill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [148]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame           # int64

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [142]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2       # NaN 때문에 실수 값으로 바뀜.

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [149]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [154]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='bfill')
#             ,columns = states)     
# index must be monotonic increasing or decreasing   단조 증가, 단조 감소 해야한다...

# 보간(interpolation)은 로우에 대해서만 이루어짐
# 따라서 로우와 칼럼

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     3      4           5
d     6      7           8

### Dropping entries from an axis

In [155]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')      # c를 삭제하라.
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [156]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [159]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [160]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [161]:
data.drop('two', axis=1)      # 컬럼축을 기준으로

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [162]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [163]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [166]:
obj
obj[1]          # 레이블 / 위치값
obj.iloc[1]         # 함수가 아니라서  [ ]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

1.0

1.0

In [167]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [168]:
obj[['b', 'a', 'd']]      # b a d 순으로 뽑은 시리즈

b    1.0
a    0.0
d    3.0
dtype: float64

In [171]:
obj[[1, 3]]           
obj.iloc[[1,3]]

b    1.0
d    3.0
dtype: float64

b    1.0
d    3.0
dtype: float64

In [172]:
obj[obj < 2] # bool indexing

a    0.0
b    1.0
dtype: float64

In [174]:
obj['b':'c']
obj[1:2]

b    1.0
c    2.0
dtype: float64

b    1.0
dtype: float64

In [175]:
obj['b':'c'] = 5    # b,c 에 5를 대입 하겠다.  브로드캐스팅
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [176]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [177]:
data['two'] # 시리즈    / data.two

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [ ]:
data[['three', 'one']]      # select two, three from data

In [178]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [179]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [180]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [181]:
data[data < 5] = 0

In [184]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [185]:
data.loc['Colorado', ['two', 'three']]   # 데이터 프레임에서 콜로라도 2,3을 시리즈로 뽑아냄

two      5
three    6
Name: Colorado, dtype: int32

In [187]:
# data.loc[['Colorado', 'Utah'], [3, 0, 1]]    - 에러남.
data.loc[['Colorado', 'Utah'], ['four','one','two']]
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [189]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [190]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [191]:
data.loc[data.three > 5, :3]

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [3] of <class 'int'>

In [193]:
obj = Series(np.arange(7) ** 2)

In [194]:
obj

0     0
1     1
2     4
3     9
4    16
5    25
6    36
dtype: int32

In [196]:
obj[2:4]
obj.loc[2:4]       # 레이블 슬라이싱 - 2,3,4,   3개   
obj.iloc[2:4]      #     2개

2    4
3    9
dtype: int32

2     4
3     9
4    16
dtype: int32

2    4
3    9
dtype: int32

### Arithmetic and data alignment

In [197]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [198]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [199]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [200]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [203]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1
df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [204]:
df1 + df2 # 데이터 프레임을 더함
# 인덱스(row)는 정렬이 됨. 없는 것은 NaN

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [205]:
list('abcd')  # 문자열이 분리되서 나옴.

['a', 'b', 'c', 'd']

In [207]:
# 연산을 하는데, 없는 값 채우기
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
                    # 12.  => 실수로 / 2차원 3행 4열로 
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1
df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [209]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [210]:
df1.add(df2, fill_value=0)      # add 메서드
             # df2 와 더하는데, 한쪽의 값이 null이면  0으로 바꿔서 더해라.

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [211]:
df1.reindex(columns=df2.columns) 
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d   e
0  0.0  1.0   2.0   3.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [212]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [214]:
arr[0]        # 첫번째 행 
arr[0,1]      # 특정 지점의 값

array([0., 1., 2., 3.])

1.0

In [216]:
arr - arr[0]
arr - arr[1]
arr - arr[2]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

array([[-4., -4., -4., -4.],
       [ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.]])

array([[-8., -8., -8., -8.],
       [-4., -4., -4., -4.],
       [ 0.,  0.,  0.,  0.]])

In [218]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame.loc['Utah']          # 시리즈

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [219]:
frame
series

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [220]:
frame - series  # 시리즈의 데이터를 프레임에 맞춰 다 적용시켜서 뺌

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [221]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [222]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [223]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [225]:
frame - series3     # row에 값을 보고 빼고 싶다면 sub 메서드를 써서 해줘야함.

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [226]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

##### Numpy의 유니버셜 함수 적용

In [4]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
from IPython.core.

In [5]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [6]:
np.abs(frame)     # for문을 쓰지 않고도 처리 가능함.

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

###### pandas의 apply() 함수

In [20]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [21]:
frame.apply(f)    # 위의 데이터프레임이 함수 f를 적용시킨다  #  로우 기준! 컬럼명이 나옴.
                  # 원소 3개짜리 시리즈가 되었다.

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [17]:
f = lambda x: x.max() - x.min()    # 이름이 있는 람다함수   = f라는 이름이 붙음.
# lamda x :
#    y = x ** 2
#    return y
#    return x.max() - x.min()         # 시리즈를 묶어서 스칼라 값으로 나타남 => 차원이 줄어듬
                                      # 시리즈를 묶으면 데이터프레임으로도 적용 가능함.

In [14]:
# pandas.dataframe.apply

Object `dataframe.apply` not found.

In [15]:
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [19]:
frame.apply(f, axis=1)      # 1번축 방향 으로   원소 4개짜리 시리즈가 되었다.

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [22]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])  
# 어떤 x를 받아서 최대 최소값을 받아서 시리즈로 리턴 하는 것 => 인덱스는 min   max

In [24]:
frame.apply(f)        # 시리즈로 리턴되니까 어플라이를 쓰니까 데이터 프레임으로 바뀐다.

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [27]:
frame.apply(f, axis=1)
frame.apply(f, axis=1).T

             min       max
Utah   -0.519439  0.478943
Ohio   -0.555730  1.965781
Texas   0.092908  0.769023
Oregon -1.296221  1.246435

         Utah      Ohio     Texas    Oregon
min -0.519439 -0.555730  0.092908 -1.296221
max  0.478943  1.965781  0.769023  1.246435

In [26]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [ ]:
# DataFrame.applymap

In [40]:
frame
frame.applymap

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

<bound method DataFrame.applymap of                b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221>

In [35]:
format = lambda x: '%.2f' % x             # x 실수가 들어오면 소수점 2번째 자리까지 들어옴.

In [36]:
frame.applymap(format)         # format함수에 넣어서 그 결과값을 데이터 프레임으로 보여주겠다.

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [30]:
'%.2f' and '%s' % 3.141592, 'Hello'
# 실수값   String           format 방법

('3.141592', 'Hello')

In [55]:
### pandas.Series의 map()
l = [1,3,4,2]
def f1(x):
    return x**2 - 3*x

In [63]:
f1(3)
# f1(l)   # 파이썬은 R처럼 재활용 규칙이 없으므로 역시 리스트에 직접 산술연산 불가능
          # 하나하나씩 불러와서 처리를 해줘야함
# 해결방법

# 1. for 루프
result = []
for x in l:
    result.append(f1(x))
result    

# 2. 리스트 내포
result = [f1(x) for x in l]
result

# 3. map()              # 지연 연산을 위해서 처리.
result = map(f1,l)
result
list(result)            # 어떤 객체에 소속되어있는게 아니라, map 함수

0

[-2, 0, 4, -2]

[-2, 0, 4, -2]

[-2, 0, 4, -2]

In [64]:
# pandas.Series

frame['e'].map(format)      # 이미 시리즈에 있는 데이터에 대해서 mapping 해다오.

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

In [57]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

In [ ]:
# apply(), applymap(), map()
- apply(): DataFrame, Series
            입력 함수 : 집계 or 통계 계열 함수  - 데이터 프레임의 내용을 모으거나 할 때 
            
- applymap() : Dataframe
            입력 함수 : 일반 함수               - 어떤 절대치를 구해서 제곱을 하겠다...
- map() : Series                                - 시리즈에 어떤 것을 적용시키겠다...

### Sorting and ranking

In [ ]:
# 인덱스 기준 정렬

In [73]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [74]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [75]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [68]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [80]:
frame.sort_values()
frame.sort_values(by='a')

TypeError: sort_values() missing 1 required positional argument: 'by'

In [81]:
# 값 기준 정렬

In [82]:
obj = Series([4, 7, -3, 2])
obj.order()

AttributeError: 'Series' object has no attribute 'order'

In [83]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

AttributeError: 'Series' object has no attribute 'order'

In [84]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [86]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [87]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [88]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()     # 4가 2개 => 평균이 됨.
               # 같은 값은 평균내서 처리함  / -5가 가장 큰 값

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [89]:
obj.rank(method='first')    # 먼저 나온 녀석한테 등수를 주겠다.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [90]:
obj.rank(ascending=False, method='max') 
          # 내림차순

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [94]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [96]:
frame.rank(axis=0)   # 세로로   # 같은 값은 평균
frame.rank(axis=1)   # 가로로

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [97]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj     # 인덱스 객체가 리턴 됨.

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [102]:
obj.index.is_unique

False

In [103]:
obj['a']

a    0
a    1
dtype: int64

In [104]:
obj['c']

4

In [101]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [106]:
df.loc['b']       # 레이블을 써야함
df.iloc[3]      # 위치값을 써야함.

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

0    0.476985
1    3.248944
2   -1.021228
Name: b, dtype: float64

## Summarizing and computing descriptive statistics

In [107]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],          # 로우 4개, 중간중간 null 값 들어가있고,
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [108]:
df.sum()       # axis = 0 가 디폴트 값   / 칼럼 단위로 / 위에서 아래로

one    9.25
two   -5.80
dtype: float64

In [109]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [110]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [115]:
df.idxmax()
df.max()
df.loc[df.idxmax()]

one    b
two    d
dtype: object

one    7.1
two   -1.3
dtype: float64

    one  two
b  7.10 -4.5
d  0.75 -1.3

In [116]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [117]:
df.describe()
# 1분위 ~ 4분위  등등....

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [118]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()      # 데이터가 숫자면 위의 처럼 해주나, 문자 같은 수치데이터가 아닌 것이면
# 빈도수, 유니크한 갯수, 가장 많이 나온 데이터, 그것이 몇번 나왔는가?

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [121]:
import pandas.io.data as web

# conda search pandas-datareader
# conda install pandas-datareader

#  ~ pandas_datareader 패키지 설치

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

ImportError: The pandas.io.data module is moved to a separate package (pandas-datareader). After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.

In [120]:
returns = price.pct_change()
returns.tail()

NameError: name 'price' is not defined

In [122]:
returns.MSFT.corr(returns.IBM)

NameError: name 'returns' is not defined

In [123]:
returns.MSFT.cov(returns.IBM)

NameError: name 'returns' is not defined

In [ ]:
returns.corr()

In [ ]:
returns.cov()

In [124]:
returns.corrwith(returns.IBM)
# 시리즈, dataframe 의 상관관계를 구하고 싶을 떄

NameError: name 'returns' is not defined

In [ ]:
returns.corrwith(volume)

### Unique values, value counts, and membership

In [125]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])  # 정수 인덱스가 생성될 것임

In [126]:
uniques = obj.unique()  # 시리즈에 unique => 중복된 값은 제거 하고 !
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [127]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [128]:
pd.value_counts(obj.values, sort=False)   # pandas 에서 호출
                 # 시리즈 값 넣고  # 정렬 하지 말아달라

d    1
b    2
c    3
a    3
dtype: int64

In [129]:
mask = obj.isin(['b', 'c']) # obj의 값들이 b와 c중에 있느냐?
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [130]:
obj[mask]      # True가 되는 값들만 들어감.

0    c
5    b
6    b
7    c
8    c
dtype: object

In [131]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [135]:
result = data.apply(pd.value_counts).fillna(0)
           #밸류카운트를 적용한....  컬럼 별로 쪼게서 넣어주고,  # null 값은 0으로 채워라.
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [136]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [137]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [138]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [140]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

### Filtering out missing data

In [142]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data
data.dropna()   # Series

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [143]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [152]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

data
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [160]:
data.dropna(how='all')   # 한개라도 값이 있으면 남겨둬라.      drop되는 것이 로우축  예상과 다를 수 있음.
data.dropna(how='all', axis=1)

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [161]:
data[4] = NA     # 
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [162]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [163]:
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA; df.loc[:2, 2] = NA
df
df = DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA; df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

          0         1         2
0  0.286350       NaN       NaN
1  0.331286       NaN       NaN
2  0.246674       NaN  1.004812
3  1.327195       NaN -1.549106
4  0.022185  0.758363 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [164]:
df.dropna(thresh=3)

          0         1         2
4  0.022185  0.758363 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

### Filling in missing data

In [166]:
df.fillna(0)  # null => 0 채우기

          0         1         2
0  0.286350  0.000000  0.000000
1  0.331286  0.000000  0.000000
2  0.246674  0.000000  1.004812
3  1.327195  0.000000 -1.549106
4  0.022185  0.758363 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [189]:
df.fillna({1: 0.5, 2: -1})    # {}
df # 원본은 안바뀜!!

          0         1         2
0 -0.301350  0.498791 -0.823991
1  1.320566  0.507965 -0.653438
2  0.186980  0.500000 -0.272293
3 -0.017141  0.500000  0.635512
4 -0.757177  0.500000 -1.000000
5 -1.677790  0.500000 -1.000000

          0         1         2
0 -0.301350  0.498791 -0.823991
1  1.320566  0.507965 -0.653438
2  0.186980       NaN -0.272293
3 -0.017141       NaN  0.635512
4 -0.757177       NaN       NaN
5 -1.677790       NaN       NaN

In [170]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)          # 원본이 바뀜.
df                   # 원본을 바꿔라.

          0         1         2
0  0.286350  0.000000  0.000000
1  0.331286  0.000000  0.000000
2  0.246674  0.000000  1.004812
3  1.327195  0.000000 -1.549106
4  0.022185  0.758363 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [186]:
df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df

          0         1         2
0 -2.252797 -1.166832  0.353607
1  0.702110 -0.274569 -0.139142
2  0.107657       NaN -0.417064
3 -0.017007       NaN -1.800840
4  1.634736       NaN       NaN
5  0.555154       NaN       NaN

In [174]:
df.fillna(method='ffill')         # 앞에 있는 값

          0         1         2
0  1.010737  1.824875 -0.997518
1  0.850591 -0.131578  0.912414
2  0.188211 -0.131578 -0.114928
3  2.003697 -0.131578  0.795253
4  0.118110 -0.131578  0.795253
5  0.152677 -0.131578  0.795253

In [176]:
df.fillna(method='ffill', limit=2)     # 2개까지만 채워라

          0         1         2
0  1.010737  1.824875 -0.997518
1  0.850591 -0.131578  0.912414
2  0.188211 -0.131578 -0.114928
3  2.003697 -0.131578  0.795253
4  0.118110       NaN  0.795253
5  0.152677       NaN  0.795253

In [177]:
data.mean()

0    1.0
1    6.5
2    3.0
4    NaN
dtype: float64

In [180]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())           # (null값에 평균 값으로 채워라)
x = data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [187]:
# 퀴즈 : df 데이터프레임에서 각 컬럼의 NaN 값을 해당 컬럼의 평균값으로 채우세요.
df = DataFrame(np.random.randn(6, 3))
df
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df
df.mean()
df.fillna(df.mean())
#---------------------

          0         1         2
0 -0.301350  0.498791 -0.823991
1  1.320566  0.507965 -0.653438
2  0.186980 -0.391725 -0.272293
3 -0.017141  0.680321  0.635512
4 -0.757177  0.718086 -0.304273
5 -1.677790  0.426986 -1.563740

          0         1         2
0 -0.301350  0.498791 -0.823991
1  1.320566  0.507965 -0.653438
2  0.186980       NaN -0.272293
3 -0.017141       NaN  0.635512
4 -0.757177       NaN       NaN
5 -1.677790       NaN       NaN

0   -0.207652
1    0.503378
2   -0.278552
dtype: float64

          0         1         2
0 -0.301350  0.498791 -0.823991
1  1.320566  0.507965 -0.653438
2  0.186980  0.503378 -0.272293
3 -0.017141  0.503378  0.635512
4 -0.757177  0.503378 -0.278552
5 -1.677790  0.503378 -0.278552

In [209]:
# 샘 답안
df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df
fn = {0: df[0].mean(), 1: df[1].mean(), 2:df[2].mean()} ; fn
df.fillna(fn)
#-------
df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df
df.mean()   # 시리즈 리턴
df.fillna(df.mean())                    # 칼럼을 추가해도 코드가 바뀌진 않음

          0         1         2
0  1.512406  0.526493 -0.266931
1  0.862284  0.083803 -1.872339
2 -0.962791       NaN  0.128726
3 -0.479120       NaN  0.745974
4 -0.622547       NaN       NaN
5 -0.056715       NaN       NaN

{0: 0.04225284884868946, 1: 0.3051480932530334, 2: -0.31614237170096904}

          0         1         2
0  1.512406  0.526493 -0.266931
1  0.862284  0.083803 -1.872339
2 -0.962791  0.305148  0.128726
3 -0.479120  0.305148  0.745974
4 -0.622547  0.305148 -0.316142
5 -0.056715  0.305148 -0.316142

          0         1         2
0  1.489410  1.264250 -0.761837
1 -0.331617 -1.751315  0.628894
2  0.282502       NaN -0.500607
3  0.121645       NaN -0.970999
4 -0.619332       NaN       NaN
5  0.503699       NaN       NaN

0    0.241051
1   -0.243533
2   -0.401137
dtype: float64

          0         1         2
0  1.489410  1.264250 -0.761837
1 -0.331617 -1.751315  0.628894
2  0.282502 -0.243533 -0.500607
3  0.121645 -0.243533 -0.970999
4 -0.619332 -0.243533 -0.401137
5  0.503699 -0.243533 -0.401137

In [199]:
# 퀴즈 : df 데이터프레임에서 각 컬럼의 NaN 값을 해당 로우의 평균값으로 채우세요.
df = DataFrame(np.random.randn(6, 3))
df
df.iloc[2:, 0] = NA; df.iloc[3:, 2] = NA
df
x = df.mean(axis = 1)
df.mean(axis = 1)
df.T.fillna(x).T

          0         1         2
0  2.128746  1.409605 -0.105434
1  0.700428  2.092852 -0.136972
2 -0.930489  0.327497  1.303013
3 -1.409402 -0.144126 -0.716414
4  0.103614 -1.495719 -1.174894
5  2.613999 -0.689307 -0.751653

          0         1         2
0  2.128746  1.409605 -0.105434
1  0.700428  2.092852 -0.136972
2       NaN  0.327497  1.303013
3       NaN -0.144126       NaN
4       NaN -1.495719       NaN
5       NaN -0.689307       NaN

0    1.144306
1    0.885436
2    0.815255
3   -0.144126
4   -1.495719
5   -0.689307
dtype: float64

          0         1         2
0  2.128746  1.409605 -0.105434
1  0.700428  2.092852 -0.136972
2  0.815255  0.327497  1.303013
3 -0.144126 -0.144126 -0.144126
4 -1.495719 -1.495719 -1.495719
5 -0.689307 -0.689307 -0.689307

In [217]:
# 샘 답안
df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df
df.mean(axis=1)
# df.fillna(df.mean(), axis=1)         - 아직은 안됨 / 컬럼 by 컬럼 만 됨.
df.T.fillna(df.mean())

          0         1         2
0  0.937250 -0.720102 -1.593952
1 -0.375498 -0.958704  0.794336
2 -1.605108       NaN  0.925166
3 -1.469629       NaN  1.417343
4 -0.897609       NaN       NaN
5 -1.490932       NaN       NaN

0   -0.458935
1   -0.179955
2   -0.339971
3   -0.026143
4   -0.897609
5   -1.490932
dtype: float64

          0         1         2         3         4         5
0  0.937250 -0.375498 -1.605108 -1.469629 -0.897609 -1.490932
1 -0.720102 -0.958704  0.385723       NaN       NaN       NaN
2 -1.593952  0.794336  0.925166  1.417343       NaN       NaN

### Hierarchical indexing

In [219]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    2.029923
   2   -0.501945
   3   -0.159285
b  1   -1.496216
   2    0.011448
   3    0.419446
c  1    2.051214
   2   -0.368765
d  2   -1.689255
   3    0.147681
dtype: float64

In [220]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [221]:
data['b']

1   -1.496216
2    0.011448
3    0.419446
dtype: float64

In [222]:
data['b':'c']

b  1   -1.496216
   2    0.011448
   3    0.419446
c  1    2.051214
   2   -0.368765
dtype: float64

In [223]:
data.loc[['b', 'd']]

b  1   -1.496216
   2    0.011448
   3    0.419446
d  2   -1.689255
   3    0.147681
dtype: float64

In [ ]:
data[:, 2]  # 데이터가 시리즈니까    멀티 인덱스
   # 레벨 0, 레벨 1  
   # 상위 인덱스 / 하위의 2번 인덱스

In [227]:
data # 원본은 이렇게 생김
data.unstack()    # 현재 데이터 = 시리즈 데이타 / 
  # stack은 인덱스를 옮겨줌 => unstack : 로우 인덱스를 컬럼쪽으로 올려주고  
                             #  stack :  컬럼 인덱스를 로우 쪽으로 내려줌.

a  1    2.029923
   2   -0.501945
   3   -0.159285
b  1   -1.496216
   2    0.011448
   3    0.419446
c  1    2.051214
   2   -0.368765
d  2   -1.689255
   3    0.147681
dtype: float64

          1         2         3
a  2.029923 -0.501945 -0.159285
b -1.496216  0.011448  0.419446
c  2.051214 -0.368765       NaN
d       NaN -1.689255  0.147681

In [228]:
data.unstack().stack()

a  1    2.029923
   2   -0.501945
   3   -0.159285
b  1   -1.496216
   2    0.011448
   3    0.419446
c  1    2.051214
   2   -0.368765
d  2   -1.689255
   3    0.147681
dtype: float64

In [229]:
data.unstack(level = -1)   # -1 디폴트 값.  가장 밑에 있는 것

          1         2         3
a  2.029923 -0.501945 -0.159285
b -1.496216  0.011448  0.419446
c  2.051214 -0.368765       NaN
d       NaN -1.689255  0.147681

In [232]:
data.unstack(level=0)
data.unstack(level=1)

          a         b         c         d
1  2.029923 -1.496216  2.051214       NaN
2 -0.501945  0.011448 -0.368765 -1.689255
3 -0.159285  0.419446       NaN  0.147681

          1         2         3
a  2.029923 -0.501945 -0.159285
b -1.496216  0.011448  0.419446
c  2.051214 -0.368765       NaN
d       NaN -1.689255  0.147681

In [233]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame  # 멀티인덱스 파일

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [234]:
frame.index.names = ['key1', 'key2']      # => 인덱스의 이름이 바뀜
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [236]:
frame['Ohio']  # 데이터 프레임으로 나옴 (값들이 있으므로)

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [237]:
frame
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [239]:
frame.sort_index(1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [242]:
frame.swaplevel(0, 1).sort_index(0)        
          # 0번 레벨(a,b)과 1번 레벨(1,2)을 자리바꿔라   + # 인덱스 정렬 (1,2 순서대로)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [245]:
frame
frame.sum(level='key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [247]:
frame.sum(level='color', axis=1)     # 그린은 그린끼리 더하고!

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [248]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [249]:
frame2 = frame.set_index(['c', 'd'])   # 인덱스로 설정해 주세요. 
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [250]:
frame.set_index(['c', 'd'], drop=False)
                           # 인덱스로 빠진 것 빼지 말아달라.

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [251]:
frame2.reset_index()
      # 초기화 시킴

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [254]:
ser = Series(np.arange(3.))
ser       # 시리즈를 만듬.
ser.iloc[-1]    # -1번째 = 마지막 원소값을 가르킴
ser[-1]         #  -1   = 레이블로 인식함 => -1 값을 찾음  => 에러가 남.

0    0.0
1    1.0
2    2.0
dtype: float64

2.0

KeyError: -1

In [255]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [258]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]     # 위치
ser.iloc[-1]       # 위치

2.0

2.0

In [262]:
ser
ser.loc[:1]   
# ser2.loc[:1]    # type 에러   => iloc로 해주어야함

0    0.0
1    1.0
2    2.0
dtype: float64

0    0.0
1    1.0
dtype: float64

In [264]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3
ser3.iloc[2]

-5    0
 1    1
 3    2
dtype: int64

2

In [267]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])

In [268]:
frame[0]

2    0
0    2
1    4
Name: 0, dtype: int32

### Panel data

In [ ]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [ ]:
pdata

In [ ]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

In [ ]:
pdata.ix[:, '6/1/2012', :]

In [ ]:
pdata.ix['Adj Close', '5/22/2012':, :]

In [ ]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

In [ ]:
stacked.to_panel()